{
    "Name":"WaterFall",
    "Beginning":"On my search for an opportunity to work with the latest web frameworks, I came across the position you have open for a Senior Software Engineer. I’ve been using SPA frameworks for the past two years in my work as a consultant for a number of clients as well as on my own projects. One such project is a skeleton stack that has many capabilities, is useful for a wide range of development scenarios, and might be applicable to your projects. Through building that stack, my work as a consultant, and my other personal projects, I have found enjoyment in fitting front-end libraries together like tetris pieces. Now I’m looking to continue to bring all of this work and experience together by joining a team and making something together that we can be proud of.",
    "Middle":"But enough about why I want to work for you. This site is a summation of the skills I’ve gained while consulting, and an example of what I can do for you. It has been developed using the aforementioned stack, using durandal/knockout client side libraries, as well as zurb foundation for presentation using Sass. It has all the observable capabilities baked into every aspect of it, from dates, to input masks, and from localization (i18n) to formating. I’ve worked with all of these tools in my professional experiences as a consultant and I’ve taken time to find the best of the best. Integration of libraries is what I do best, and this stack of libraries showcases that ability, keeping separation of concerns, modularizing, and working with the single page application way of developing software.",
    "End":"I hope that you enjoy the work I’ve put together, and heck, even if you don’t hire me, take a look at my Github and see if any of my work can be used in your stack. It’s all open source, this framework is installable using node and mimosa, and my other projects are on bower, npm and nuget. I look forward to hearing back from you, and check back on this site often, as it will be updated with all of my latest work on this framework."
}