{
    "Name":"WaterFall",
    "Beginning":"Sur ma recherche d'une occasion de travailler avec les derniers frameworks web, je suis tombé sur la position que vous avez ouvert pour un Senior Software Engineer. Je me sers de cadres de SPA pour les deux dernières années dans mon travail en tant que consultant pour un certain nombre de clients ainsi que sur mes propres projets. Un tel projet est une pile de squelette qui a beaucoup de capacités, est utile pour un large éventail de scénarios de développement, et pourrait être applicable à vos projets. Grâce à la construction de cette pile, mon travail en tant que consultant, et mes autres projets personnels, je ai trouvé la jouissance dans les bibliothèques frontaux emboîtant comme des morceaux de tetris. Maintenant, je suis à la recherche de continuer à faire tout ce travail et de l'expérience était de regrouper une équipe et de faire quelque chose ensemble que nous pouvons être fiers.",
    "Middle":"Mais assez parlé de la raison pour laquelle je veux travailler pour vous. Ce site est une sommation des compétences que je ai acquise en consultation, et un exemple de ce que je peux faire pour vous. Il a été développé en utilisant la pile ci-dessus, l'utilisation de bibliothèques côté client durandal / knock-out, ainsi que la fondation Zurb pour présentation à l'aide Sass. Il a toutes les capacités de boulangerie observables dans tous les aspects de celui-ci, de dates, de masques de saisie et de localisation (i18n) à formatage. Je ai travaillé avec tous ces outils dans mes expériences professionnelles en tant que consultant et je ai pris le temps de trouver le meilleur du meilleur. Intégration des bibliothèques est ce que je fais de mieux, et cet empilement de bibliothèques présente cette capacité, en gardant la séparation des préoccupations, la modularisation, et de travailler avec la manière de développer des logiciels page de demande unique.",
    "End":"Je espère que vous appréciez le travail que je ai mis en place, et Heck, même si vous ne me engagez pas, jetez un oeil à mon Github et voir si l'un de mon travail peut être utilisé dans votre pile. Ce est open source, ce cadre est installable à l'aide noeud et de mimosa, et mes autres projets sont en tonnelle, NPM et NuGet. Je ai hâte d'entendre en arrière de vous, et revenez sur ce site souvent, car il sera mis à jour avec l'ensemble de mon dernier ouvrage sur ce cadre."
}